```hcl
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: Terraform used the selected providers to generate the following execution
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: plan. Resource actions are indicated with the following symbols:
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:   ~ update in-place
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:  <= read (data resources)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: Terraform will perform the following actions:
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:   # module.elasticsearch.module.elasticsearch.data.ibm_database_connection.database_connection will be read during apply
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:   # (depends on a resource or a module with changes pending)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:  <= data "ibm_database_connection" "database_connection" {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + amqps         = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + analytics     = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + bi_connector  = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + cli           = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + deployment_id = "crn:v1:bluemix:public:databases-for-elasticsearch:us-south:a/abac0df06b644a9cabc6e44f55b3880e:04e50257-5597-446a-bbac-4d9ff5df77a8::"
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + emp           = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + endpoint_type = "private"
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + grpc          = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + https         = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + id            = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + mongodb       = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + mqtts         = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + mysql         = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + ops_manager   = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + postgres      = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + rediss        = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + secure        = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + stomp_ssl     = (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + user_id       = "admin"
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + user_type     = "database"
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:     }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:   # module.elasticsearch.module.elasticsearch.ibm_database.elasticsearch will be updated in-place
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:   ~ resource "ibm_database" "elasticsearch" {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:         id                      = "crn:v1:bluemix:public:databases-for-elasticsearch:us-south:a/abac0df06b644a9cabc6e44f55b3880e:04e50257-5597-446a-bbac-4d9ff5df77a8::"
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:         name                    = "elasticsearch"
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:         tags                    = []
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:         # (17 unchanged attributes hidden)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       - group {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:           - group_id = "member" -> null
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:           - cpu {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:               - allocation_count = 0 -> null
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:             }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:           - disk {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:               - allocation_mb = 5120 -> null
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:             }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:           - members {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:               - allocation_count = 3 -> null
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:             }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:           - memory {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:               - allocation_mb = 1024 -> null
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:             }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:         }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:       + group {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:           + group_id = "member"
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:           + cpu {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:               + allocation_count = 0
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:             }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:           + disk {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:               + allocation_mb = 5120
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:             }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:           + members {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:               + allocation_count = 3
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:             }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:           + memory {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:               + allocation_mb = 4096
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:             }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:         }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:         # (2 unchanged blocks hidden)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:     }
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: Plan: 0 to add, 1 to change, 0 to destroy.
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: Changes to Outputs:
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:   ~ hostname                   = "04e50257-5597-446a-bbac-4d9ff5df77a8.c13paqsd05a0ept695ng.private.databases.appdomain.cloud" -> (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185:   ~ port                       = 30320 -> (known after apply)
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: ╷
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: │ Warning: Note: IBM Cloud Databases released new Hosting Models on May 1. All existing multi-tenant instances will have their resources adjusted to Shared Compute allocations during August 2024. To monitor your current resource needs, and learn about how the transition to Shared Compute will impact your instance, see our documentation https://cloud.ibm.com/docs/cloud-databases?topic=cloud-databases-hosting-models
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: │ 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: │   with module.elasticsearch.module.elasticsearch.ibm_database.elasticsearch,
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: │   on ../../main.tf line 48, in resource "ibm_database" "elasticsearch":
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: │   48: resource "ibm_database" "elasticsearch" {
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: │ 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: ╵
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: ─────────────────────────────────────────────────────────────────────────────
TestRunSecureUpgradeSolution 2024-06-17T09:47:16Z command.go:185: 
```

There is still nothing unexpected from the upgrade test. An update in place as 1G default memory changes to 4G default.